src/cf/Catalogs/CRM_Категории.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>CRM_Категории</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЦветПредставление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветИндекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветКрасный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветЗеленый</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветСиний</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/CRM_Категории/Forms/ФормаЭлемента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
// Процедура - обработчик события "НачалоВыбора" элемента формы "Цвет"
//
Процедура ЦветНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("ТекущийЦвет", Объект.ЦветИндекс);
	ОповещениеНовое = Новый ОписаниеОповещения("ЦветНачалоВыбораЗавершение", ЭтотОбъект);
	ФормаВыбораЦвета = ОткрытьФорму("Справочник.CRM_Категории.Форма.ФормаВыбораЦвета", ПараметрыФормы, Элемент,,,,
		ОповещениеНовое, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);	
КонецПроцедуры // ЦветНачалоВыбора()

&НаКлиенте
// Продолжение процедуры "ЦветНачалоВыбора"
//
Процедура ЦветНачалоВыбораЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если НЕ (Результат = Неопределено) И НЕ (Результат = КодВозвратаДиалога.Отмена) Тогда
		Объект.ЦветПредставление 	= Результат[0].Представление;
		Объект.ЦветИндекс 			= Результат[0].Картинка;
		Объект.ЦветКрасный 			= Результат[0].Красный;
		Объект.ЦветЗеленый 			= Результат[0].Зеленый;
		Объект.ЦветСиний 			= Результат[0].Синий;
		Элементы.Цвет.ЦветФона 		= Новый Цвет(Объект.ЦветКрасный,Объект.ЦветЗеленый,Объект.ЦветСиний);
		Элементы.Цвет.ЦветТекста	= CRM_ОбщегоНазначенияКлиентСервер.ПолучитьКонтрастныйЦвет(Элементы.Цвет.ЦветФона);
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры	

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" элемента формы "Цвет"
//
Процедура ЦветПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры // ЦветПриИзменении()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМЫ

&НаСервере
// Процедура - обработчик события формы "ПриСозданииНаСервере"
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Ссылка) ИЛИ ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		Элементы.Цвет.ЦветФона		= Новый Цвет(Объект.ЦветКрасный, Объект.ЦветЗеленый, Объект.ЦветСиний); 
		Элементы.Цвет.ЦветТекста	= CRM_ОбщегоНазначенияКлиентСервер.ПолучитьКонтрастныйЦвет(Элементы.Цвет.ЦветФона);
	Иначе
		Объект.ЦветИндекс			= 10;
		Объект.ЦветПредставление 	= НСтр("ru = 'Стальной'");
    	Объект.ЦветКрасный  		= 196;	
		Объект.ЦветЗеленый  		= 232; 
		Объект.ЦветСиний  			= 190;
		Элементы.Цвет.ЦветФона		= Новый Цвет(Объект.ЦветКрасный, Объект.ЦветЗеленый, Объект.ЦветСиний); 
		Элементы.Цвет.ЦветТекста	= CRM_ОбщегоНазначенияКлиентСервер.ПолучитьКонтрастныйЦвет(Элементы.Цвет.ЦветФона);
	КонецЕсли;
КонецПроцедуры // ПриСозданииНаСервере()
